Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པས་གནང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ལས་ལ་བརྩོན་པ་ལགས། ཇི་ལྟར་བརྩོན་པར་བགྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྒྱལ་པོ་ཉེ་བར་འགྱུར་བ་བདག་ལ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རྣམ་པར་གདུལ་བའི་མཐར་ཕྱིན་པར་བྱ་བ་དང་།
en: How do bodhisattvas, authorized by the tathāgatas, dedicate themselves to bodhisattva conduct so that, having become dedicated, they become kings of the Dharma.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཡང་དག་པར་གཟུང་བའི་སྦྱོར་བ་མཐར་ཕྱིན་པར་བྱ་བ་དང་། ཕྱོགས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་དགང་བའི་ཡེ་ཤེས་རབ་ཏུ་སྦྱར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་མངོན་དུ་འགྱུར་བ་དང་། ཤེས་བྱ་ནམ་མཁའི་དབྱིངས་དང་མཉམ་པར་མཐའ་ཡས་པ་རྒྱས་པར་དགང་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བླང་ཞིང་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་འགྲོ་བ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པའི་སྤྱོད་པའི་ཚུལ་ཡོངས་སུ་འདྲི་བ་ལེགས་སོ་ལེགས་སོ། །
en: The night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you ask about conduct that is a rain from clouds of Dharma that accords with the aspiration of the entire ocean of beings, so as to reach the conclusion of ripening and guiding all beings; so as to reach the conclusion of joining and maintaining the family of the tathāgatas; so as to conjoin with the wisdom that pervades throughout the extent of the directions; so as to focus on comprehending the entire ocean of the ways of the realm of the Dharma; so as to pervade the infinity of all that can be known, which is as vast as the extent of space; and so as to obtain and possess the wheels of Dharma of all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called the entry into beautiful sounds and profound manifestations.

source: དེ་ལྟར་ཁོ་མོ་རྣམ་པར་ཐར་པ་དེ་དང་ལྡན་པས་ཆོས་སྨྲ་བ་ཆེན་པོའི་གོ་འཕང་ཐོགས་པ་མེད་པ་ལ་དམིགས་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: “Noble one, through this liberation I undertake being on the unimpeded level of a dharmabhāṇaka.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་གཏང་བའི་སྨོན་ལམ་དང་ལྡན་པ།
en: I have the aspiration to make a gift of the Dharma treasure of all the tathāgatas.

source: སྙིང་རྗེ་ཆེན་པོ་དང་བྱམས་པ་ཆེན་པོའི་སྟོབས་རབ་ཏུ་ཐོབ་པ།
en: I have attained the power of great love and compassion.

source: སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་ལ་འགོད་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱ་བ་ལ་ཞུགས་པ།
en: I am dedicated to activities that benefit all beings in order to bring all beings to the aspiration for enlightenment.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དགེ་བའི་རྩ་བ་དང་། ཚོགས་རབ་ཏུ་བསྩགས་པ་རྒྱུན་མི་གཅད་པའི་ཕྱིར།
en: I remain on the level of a guide for beings so that they will continuously gather the accumulation of the roots of merit of the aspiration for enlightenment.

source: འགྲོ་བ་ཐམས་ཅད་ཁ་ལོ་བསྒྱུར་བའི་ས་ལ་ཡང་དག་པར་གནས་པ་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལ་རབ་ཏུ་དགོད་པའི་ཕྱིར། འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ལས་ཆོས་ཀྱི་ཉི་མ་ཡོངས་སུ་འབྱུང་བའི་སྦྱོར་བ་དང་ལྡན་པ།
en: In order to bring all beings onto the path to omniscience, I engage in causing the sun of the Dharma to appear out of the clouds of the Dharma in the world.

source: དགེ་བའི་རྩེ་བ་ཚད་མེད་པ་བསྐྱེད་པས། འཇིག་རྟེན་ཐམས་ཅད་སྣང་བར་བྱ་བའི་ཕྱིར། འགྲོ་བ་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་སུ་འཇུག་པ་རྒྱུན་མི་འཆད་པ།
en: I continuously engage in a motivation that regards all beings as equal in order to illuminate all worlds with countless roots of merit.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བ་ཡོངས་སུ་བསྒྲུབ་པའི་སྦྱོར་བ་ཤེས་པར་བྱ་བའི་ཕྱིར།
en: I am conjoined with a pure motivation so that all beings will know the accomplishment of accumulating roots of merit.

source: སེམས་རྣམ་པར་དག་པའི་སྦྱོར་བ་དང་ལྡན་པ་དགེ་བའི་ལས་ཀྱི་ལམ་ཐམས་ཅད་མཐུན་པར་བསྒྲུབ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དེད་དཔོན་དུ་ཞུགས་པ། མི་དགེ་བའི་ལས་ཀྱི་ལམ་ཐམས་ཅད་རབ་ཏུ་སྤངས་པ། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་ཆོས་ལ་རབ་ཏུ་དགོད་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: I engage in being a leader of the caravan of all beings so that they will appropriately accomplish all the paths of good actions; I am engaged in the activity of causing all beings to reject all paths of bad actions and be established in the Dharma of good actions.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ལམ་བདེ་བ་ཡོངས་སུ་སྟོན་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: I am engaged in teaching the path to happiness to all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེག་པའི་རྒྱན་གྱི་ཐོག་མར་འདྲེན་པ་ལ་ཞུགས་པ།
en: I bring all beings to the beginning of the array of the yānas.

source: དགེ་བའི་ཆོས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ལ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགོད་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: I am engaged in establishing all beings in all virtuous Dharma practices.

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལ་མི་ཕྱེད་པར་བསྙེན་བཀུར་དང་རིམ་གྲོ་བྱེད་པ་ལ་ཞུགས་པ།
en: I am engaged in providing unceasing service and veneration to all kalyāṇamitras.

source: སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་དགོད་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: I am engaged in establishing all beings in the teaching of the tathāgatas.

source: ཆོས་ཀྱི་སྦྱིན་པའི་སྔོན་འདྲེན་ཅིང་ཆོས་དཀར་པོ་ཐམས་ཅད་ཡང་དག་པར་བརྩམ་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: I am engaged in causing all beings to commence upon good qualities through receiving the very first gift of the Dharma.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་བསྐྱེད་པས་མངོན་པར་བྱུང་བས་བསམ་པ་བརྟན་ཞིང་མི་ཤིགས་པ།
en: I cause the arising of an aspiration for omniscience that is enduring and indestructible.

source: རྡོ་རྗེ་མཐུ་བོ་ཆེ་ལྟར་བརྟན་ཞིང་སྲ་བས་སངས་རྒྱས་ཀྱི་སྟོབས་ལ་དམིགས་པའི་སེམས་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་དང་ལྡན་པར་དགེ་བའི་བཤེས་གཉེན་ལ་རྟེན་ཅིང་རྣམ་པར་སྤྱོད་དེ།
en: I have the vast domain of the aspiration focused on the strengths of the Buddha, which is as enduring and solid as the most powerful vajra, and I practice by relying on a kalyāṇamitra.

source: ཁོ་མོ་ནི་ཉོན་མོངས་པ་དང་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་གཏོར་བའི་སེམས་དང་ལྡན་པའོ། །
en: “I have a mind that shatters the mountain of all the obscurations from karma and kleśas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡང་དག་པར་རྩོམ་པའོ། །
en: I am dedicated to the accumulation of omniscience.

source: དཀར་པོའི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པའི་སྦྱོར་བ་དང་ལྡན་པའོ། །
en: I am engaged in accomplishing all good qualities.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་མཐའ་དང་དབུས་མེད་པ་ལ་མངོན་པར་འདུན་ཅིང་དམིགས་པའི་སེམས་ཀྱི་སྦྱོར་བ་ལ་བརྩོན་པའོ། །
en: I am dedicated to being engaged in a mind that is focused on and aspires for omniscience that has no end or center.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ཆོས་སྣང་བའི་སྒོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་རྣམ་པ་དེ་ལ་བུ་ཡོངས་སུ་སྦྱོང་ཞིང་དགེ་བའི་རྩ་བ་བསྩགས་པའི་ཚོགས་ལ་སྟ་གོན་ཏུ་གནས་པས་རྣམ་པ་བཅུས་ཆོས་ཀྱི་དབྱིངས་ལ་རྣམ་པར་བལྟ་ཞིང་ཁོང་དུ་ཆུད་པ་དང་།
en: “Noble one, in that way, I am purifying the revelation to all beings of the gateway to the light of the Dharma, and I am establishing them in gathering the accumulation of roots of merit.

source: རྗེས་སུ་གཞོལ་བར་བྱེད་དོ། །
en: “I look upon, comprehend, and fathom the realm of phenomena in ten ways.

source: ཡེ་ཤེས་སྣང་བ་ཤིན་ཏུ་ཡངས་པ་ཐོབ་པས་ཆོས་ཀྱི་དབྱིངས་ནི་ཚད་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (1) I comprehend the realm of phenomena because I have attained the vast light of wisdom.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་མཐའ་དང་དབུས་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (2) I comprehend the realm of phenomena as having no end and no center in order to perceive the miraculous manifestations of all the tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་གནན་པ་དང་། དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་མུ་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (3) I comprehend the realm of phenomena as limitless in order to reach all buddha realms and to make offerings and show veneration to the tathāgatas.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་ས་མཚམས་མེད་པ་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (4) I comprehend the realm of phenomena as having no boundary in order to have the vision of bodhisattva activities within the ocean of all worlds.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཐ་མི་དད་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ནི་རིས་ཚད་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (5) I comprehend the realm of phenomena as being without division in order to enter the undivided domain of wisdom of the tathāgatas.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་པའི་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་དཀྱིལ་འཁོར་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་རྒྱུད་ཀྱི་ཚུལ་གཅིག་ཏུ་གྱུར་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (6) I comprehend the realm of phenomena as singleness in order to enter the domain of speech of the tathāgatas, which is perceived by all beings in accordance with their aspirations.

source: འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་གདུལ་བའི་མཐར་ཕྱིན་པས། དེ་བཞིན་གཤེགས་པས་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐར་ཐུག་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ནི་རང་བཞིན་གྱི་རྒྱ་ཆེ་བར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (7) I comprehend the realm of phenomena as having a nature of vastness in order to realize the ultimate conclusion of the past prayers of the tathāgatas to reach the conclusion of guiding all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་འབྱམ་ཀླས་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ནི་འགྲོ་བ་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དུ་གྱུར་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (8) I comprehend the realm of phenomena as having the equality of all beings in order to realize the vast extent of completely good bodhisattva conduct.

source: ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་རྒྱན་གཅིག་ཏུ་གྱུར་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (9) I comprehend the realm of phenomena as a single adornment in order to comprehend the adornment of the miraculous manifestations of completely good conduct.

source: དགེ་བ་ཐམས་ཅད་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་དགང་ཞིང་རྣམ་པར་དག་པར་བྱ་བར་ཆུད་མི་ཟ་བའི་ཆོས་ཅན་དུ་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ནི་ཐུག་པ་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: (10) I comprehend the realm of phenomena as being indestructible in order for the pure pervasion of the realm of phenomena by all good actions to have the nature of indestructibility.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་དགེ་བའི་རྩ་བ་དང་། ཚོགས་ཐམས་ཅད་ཡོངས་སུ་བསྩགས་པ་དང་། སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བ་ཉིད་ལ་འཇུག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་རྗེས་སུ་རྟོགས་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱ་དབྱིངས་ཐམས་ཅད་ལ་རྣམ་པར་བལྟའོ། །
en: “Noble one, I look upon, comprehend, and fathom the entire realm of phenomena in those ten ways in order to gather all the accumulations of good karma, in order to comprehend the greatness of the buddhas, and in order to realize the inconceivable scope of the buddhas.

source: ཁོང་དུ་ཆུད་པ་དང་རྗེས་སུ་གཞོལ་བར་བྱེད་དོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་བདག་ཉིད་ཆེ་བ་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཡིད་ལ་བྱ་བ་དང་ལྡན་པས། གཟུངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱུད་སྟོང་ཕྲག་བཅུས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: “Moreover, noble one, I teach the Dharma to beings with my mind fixed upon the greatness of the tathāgatas and through ten-thousandfold domains of the activity of mental retention.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟར་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། ཆོས་ཐམས་ཅད་བྱིན་གྱིས་རློབ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་།
en: What are those ten?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགོངས་པ་སྒྲོན་མའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་བྱེད་པའི་སྙིང་པོའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། ཐེག་པའི་ཚུལ་རྒྱ་མཚོ་དྲི་མ་མེད་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྒྲོན་མའི་སྙིང་པོའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་གྱི་འཁོར་ལོའི་ཀློང་རབ་ཏུ་སྒྲོག་པའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་བསྟན་པ་ལ་ཡང་དག་པར་གཞོལ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་།
en: They are (1) the domain of mental retention called the gathering of the entire ocean of the Dharma, (2) the domain of mental retention called the blessing of all dharmas, (3) the domain of mental retention called the holding of all dharmas, (4) the domain of mental retention called the lamp of the intention of all the tathāgatas, (5) the domain of mental retention called the essence that illuminates the ocean of the karma of all beings, (6) the domain of mental retention called the fathoming of the entire stainless ocean of the ways of the yānas, (7) the domain of mental retention called the proclamation of the turningof the wheel of the names of all the buddhas, (8) the domain of mental retention called the fathoming of the teaching of the ocean of the past prayers of the buddhas in the three times, (9) the domain of mental retention called the intense power of the gathering of all dharmas, and (10) the domain of mental retention called the arising of the power of omniscience.

source: ཆོས་ཐམས་ཅད་ལ་མངོན་པར་འཁྱིལ་པའི་ཤུགས་དྲག་པོའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་རབ་ཏུ་འབྱུང་བ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་། རིགས་ཀྱི་བུ་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་བཅུ་པོ་དེ་དག་ལ་སྩོགས་པ་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱུད་སྟོང་ཕྲག་བཅུས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Noble one, I teach the Dharma to beings through these ten domains of mental retention and the rest of the ten thousand domains of mental retention.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་ནི་ཐོས་པའི་ཤེས་རབ་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Moreover, noble one, I teach the Dharma to beings through the wisdom that comes from hearing the Dharma.

source: བསམ་པའི་ཤེས་རབ་དང་། བསྒོམ་པའི་ཤེས་རབ་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings through the wisdom from contemplation and the wisdom from meditation.

source: སྲིད་པའི་རྒྱུད་གཅིག་ལས་ཀྱང་བརྩམས་ཤིང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with one existence.

source: སྲིད་པའི་རྒྱུད་རྒྱ་མཚོ་ཐམས་ཅད་ལས་ཀྱང་བརྩམས་ཤིང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with all existences.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་མཚན་གྱི་འཁོར་ལོ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with the ocean of the wheel of names of one tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་གྱི་འཁོར་ལོ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམ་ཤིག་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of the wheel of names of all tathāgatas.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཅིག་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with one ocean of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with all oceans of world realms.

source: སངས་རྒྱས་གཅིག་གིས་ལུང་བསྟན་པ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with the ocean of prophecies of one buddha.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ལུང་བསྟན་པ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of prophecies of all tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with the ocean of the community of the followers of one tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of the communities of the followers of all tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་ཆོས་ཀྱི་འཁོར་ལོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with the Dharma wheel of one tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of the Dharma wheels of all tathāgatas.

source: མདོ་སྡེ་གཅིག་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with one sūtra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ལ་ཡང་དག་པར་གཞོལ་བའི་མདོ་སྡེ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the sūtras that are present within the Dharma wheels of all tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཀུན་ནས་འདུས་པ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with the gathering of the community of followers of one tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཀུན་ནས་འདུས་པ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of the gatherings of the communities of followers of all tathāgatas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་གཅིག་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with one aspiration to omniscience.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཐམས་ཅད་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the entire ocean of the aspects of the aspiration to enlightenment.

source: ཐེག་པ་གཅིག་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: “I teach the Dharma to beings beginning with one yāna.

source: ཐེག་པ་ཐམས་ཅད་ཀྱི་འབྱུང་བ་རྒྱ་མཚོ་ལས་ཀྱང་བརྩམས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to beings beginning with the ocean of the arising of all yānas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་བསྟན་པའི་ཚུལ་མངོན་པར་བསྒྲུབ་པ་བརྗོད་དུ་མེད་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐ་མི་དད་པས་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་པས།
en: “Noble one, in that way, I teach the Dharma to beings through comprehending that in the way of the realm of the Dharma there is no differentiation in the ocean of the tathāgatas.

source: བླ་ན་མེད་པའི་ཡོངས་སུ་བསྡུ་བ་བྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པ་རྒྱ་མཚོར་གནས་པར་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་འདི་ལ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་རྣམ་པར་འཕེལ་བའི་རྣམ་པར་ཐར་པའི་ཡུལ་བསྒོམ་པའི་ཚུལ་གྱིས་ཡོངས་སུ་སྒོམ་སྟེ་རྣམ་པར་ཐར་པའི་ཡུལ་བསྒོམ་པའི་ཚུལ་རེ་རེས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྒྱས་པར་འགེངས་སོ། །
en: Thereby I create an unsurpassable accumulation of the Dharma, continue with the bodhisattva’s completely good conduct throughout all future kalpas, and meditate on this bodhisattva liberation called the entry into beautiful sounds and profound manifestations, expanding with each instant of mind the way of meditation on the vista of this liberation, with each instant of mind expanding throughout the entire realm of phenomena the way of meditation on the vista of this liberation.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ། དེ་ལྟར་ཟབ་པ་ངོ་མཚར་ཆེ་ན།
en: Sudhana said, “Goddess, it is wonderful that this bodhisattva liberation is so profound.

source: འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདི་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས་སྨྲས་པ།
en: Āryā, how long has it been since you attained this bodhisattva liberation?”

source: རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་འཇིག་རྟེན་གྱི་རྒྱུད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འདས་པའི་ཕ་རོལ་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་འོད་འཕྲོ་བའི་གྲོང་ཁྱེར་དཔལ་ཀྱི་སྤྲིན་ཅེས་བྱ་བ་རིན་པོ་ཆེའི་སྤོས་ཐམས་ཅད་དང་ལྡན་པ། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སྤྲིན་ལ་བླངས་པ།
en: She replied, “Noble one, in the past, in time gone by, beyond as many kalpas as there are atoms in a world realm, there was a world realm called Dharmārci­nagara­meghā, which had as many clouds of perfumed jewels as there are atoms in a four-continent world realm.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་དབྱངས་སུ་སྒྲོག་པའི་པདྨོས་མཚམས་རྣམ་པར་བརྒྱན་པ།
en: It was bordered with lotuses that had been proclaimed in the past prayers of all the tathāgatas.

source: ལྷུན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོས་བྱུང་བའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལས་གྲུབ་པ།
en: Its body was formed from the ocean as the king of precious jewels, having arisen from the ocean of the karma of all beings.

source: པདྨོ་ཆེན་པོའི་དབྱིབས་སུ་འདུག་པ།
en: It had the shape of a great lotus.

source: རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ།
en: It was both pure and defiled.

source: མེ་ཏོག་གི་ཁོར་ཡུག་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀུན་ནས་བསྐོར་བ།
en: It had as many encircling Cakravāla mountain ranges of lotuses as there are atoms in Sumeru.

source: སྤོས་ཀྱི་རིན་པོ་ཆེ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རྒྱན་རི་རབ་ལྟར་མངོན་པར་འཕགས་པ་དང་ལྡན་པ།
en: It was adorned by as many risen Sumerus of perfumed jewels as there are atoms in Sumeru.

source: གླིང་བཞི་པ་ཆེན་པོའི་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by as many great four-continent worlds as there are atoms in Sumeru.

source: གླིང་བཞི་པ་རེ་རེ་ཞིང་ཡང་གྲོང་རྡལ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དང་ལྡན་པ་བྱུང་ངོ་། །
en: In each four-continent world there was an anabhilāpyānabhilāpya of quintillions of cities.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་དེའི་བསྐལ་པ་མདོག་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱུ་བ་བྱུང་སྟེ།
en: “Noble one, there was in that world realm a kalpa called Vimalābha.

source: བསྐལ་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ངོ་། །
en: During that kalpa there appeared as many tathāgatas as there are atoms in Sumeru.

source: འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་འོད་འཕྲོ་བའི་གྲོང་ཁྱེར་དཔལ་གྱི་སྤྲིན་གྱི་གླིང་བཞི་པ་དབུ་མ་རྒྱལ་མཚན་སྣ་ཚོགས་ཤེས་བྱ་བ་བྱུང་སྟེ། དེའི་དབུས་ན་རྒྱལ་པོའི་གནས་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ། སྣང་བ་ཞེས་བ་བ་ཡོད་པར་གྱུར་ཏེ།
en: In the center of that world realm called Dharmārci­nagara­meghā there was a four-continent world called Vicitra­dhvaja, in the center of which was the royal capital called Samanta­ratna­kusuma­prabhā.

source: རྒྱལ་པོའི་གནས་དེ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱི་རྒྱལ་པོའི་ཕོ་བྲང་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Not far from that royal capital was a bodhimaṇḍa called Dharma­rāja­bhavana­pratibhāsa.

source: སྙིང་པོ་བྱང་ཆུབ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་གི་བསྐལ་བའི་དང་པོ་ལ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: At that bodhimaṇḍa there appeared the Tathāgata Sarva­dharma­sāgara­nirghoṣa­prabha­rāja, the first of the tathāgatas of that kalpa, who were as numerous as the atoms in Sumeru.

source: དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉི་མ་ལྟར་བཞིན་མདོག་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་བྱུང་ནས། དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་འོད་ཀྱི་རྒྱལ་པོ་ལས་མདོ་སྡེ་ཆོས་ཐམས་ཅད་ཀྱི་ཀློང་རྒྱ་མཚོ་ཞེས་བྱ་བ་ཡོངས་སུ་བཟུང་སྟེ།
en: “At that time there was a cakravartin king by the name of Vimala­vakrabhānu­prabha, who received from the Tathāgata Sarva­dharma­sāgara­nirghoṣa­prabha­rāja the sūtra called The Ocean of All Dharmas.

source: བཟུང་ནས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་བསྐོར་ཏོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་རབ་ཏུ་བྱུང་སྟེ། བསྟན་པ་ཡོངས་སུ་བཟུང་ངོ་། །
en: After he had received it, after the Dharma wheel was turned, and after the passing into nirvāṇa, the king entered homelessness and possessed all the teaching.

source: བསྟན་པ་ནུབ་དུ་ཆ་སྟེ། བསྟན་པ་ཡང་སྟོང་དུ་གྱེས། ཆོས་བསྟན་པ་ཤིན་དུ་བསྟན་པའི་ཚུལ་ནི་བརྒྱ་ཕྲག་བཅུར་གྱུར། རྙོག་པའི་བསྐལ་པ་བར་མ་ནི་ཉེ་བར་གནས་པར་གྱུར་པའི་ཚེ།
en: “At the time when the teaching was reaching its end, it divided into a thousand teachings, and in each teaching there was a division into a thousand ways of teaching.

source: སེམས་ཅན་ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པས་བསྒྲིབས་པ། ཐབ་མོ་དང་རྩོད་པ་དང་དཀྲུགས་མ་ལ་ཞུགས་པར་གྱུར་པ་དང་།
en: During the intermediate kalpa of deterioration, beings were obscured by the obscurations of karma and kleśas, and they were engaged in fighting, quarreling, and disruption.
